export enum Errors {
  /**
   * Магазин не активирован. Ошибка возникает в двух случаях:
   *
   * 1) Магазин действительно еще не активирован, а вы пытаетесь выставлять
   * счета в "боевом" режиме
   *
   * 2) В технических настройках на вашем сайте вы некорректно указали
   * Идентификатор магазина. Найти его можно в разделе "Мои магазины" вашего
   * личного кабинета, открыв нужный магазин. В закладке "Технические настройки"
   * будет поле "Идентификатор магазина". Значение данного поля нужно
   * скопировать и корректно прописать в настройках вашего сайта.
   */
  SHOP_NOT_ACTIVATED = 25,

  /**
   * Магазин не найден. Ошибка возникает в том случае, когда в технических
   * настройках на вашем сайте вы некорректно указали Идентификатор магазина.
   * Найти его можно в разделе «Мои магазины» вашего личного кабинета, открыв
   * нужный магазин. В закладке «Технические настройки» будет поле
   * «Идентификатор магазина».
   */
  SHOP_NOT_FOUND = 26,

  /**
   * Неверный параметр SignatureValue. Проверьте скрипт, отвечающий за
   * инициализацию оплаты, а именно ту часть, которая формирует SignatureValue
   * по формуле, состоящей из переменных. Самые распространенные неточности,
   * из-за которых может неверно считаться данный параметр:
   *
   * – Используется некорректный Идентификатор магазина (MerchantLogin)
   *
   * – Используется некорректный Пароль 1 (MerchantPass1)
   *
   * – Используются дополнительные пользовательские параметры (shp_), которые
   * были добавлены, но не занесены в формулу подсчета, или наоборот, в формуле
   * подсчета они указаны, а в коде нет. Если shp_ используются, то они должны
   * быть переданы в алфавитном порядке как в параметрах на оплату, так и в
   * формуле подсчета SignatureValue.
   */
  SIGNATURE_FAILED = 29,

  /**
   * Неверный параметр счёта. Проверьте правильность передаваемых как
   * обязательных, так и необязательных параметров счета.
   */
  PARAM_FAILED = 30,

  /**
   * Неверная сумма платежа. Ошибка возникает по причине того, что при
   * переадресации клиента на платежную страницу сервиса Robokassa
   * для выставления счета, вы не передаете нам сумму, на которую необходимо
   * исполнить платеж. Либо передаете сумму равную 0.
   */
  SUM_INCORRECT = 31,

  /**
   * Время отведённое на оплату счёта истекло. Ошибка показывает, что время
   * отведённое на проведение платежа этим способом истекло. Ознакомиться с
   * имеющимися временными ограничениями по способам оплаты вы можете
   * <a href='https://docs.robokassa.ru/pay-interface/'>здесь</a>.
   */
  PAYMENT_TIMEOUT = 33,

  /**
   * Услуга рекуррентных платежей не разрешена магазину. Функция проведения
   * рекуррентных платежей сначала должна быть согласована и подключена для
   * вашего магазина менеджерами. В противном случае платежи с подобной
   * настройкой работать не будут.
   */
  RECURRENT_DISABLED = 34,

  /**
   * Неверные параметры для инициализации рекуррентного платежа. Некорректные
   * параметры указаны при инициализации рекуррентного платежа. Сверьтесь
   * с соответствующим разделом технической документации и проверьте
   * настройки рекуррентных платежей у себя на сайте.
   */
  RECURRENT_PARAMS_ERROR = 35,

  /**
   * Повторная оплата счета с тем же номером невозможна. В момент формирования
   * запроса на инициализацию оплаты вы передаете значение параметра
   * InvId (номер заказа/счета), которое использовалось вами прежде. Этот
   * параметр должен принимать с каждой переадресацией в сервис Robokassa
   * уникальное значение. Ошибка показывает, что один из клиентов уже оплатил
   * данный номер заказа ранее, а сейчас вы переадресуете другого
   * плательщика, выставляя ему тот же номер счета. Оплаты при включенном
   * параметре IsTest=1 не логируются и не могут спровоцировать возникновение
   * этой ошибки.
   */
  RECEIPT_NUMBER_ERROR = 40,

  /**
   * Ошибка на старте операции. При инициализации оплаты в системе произошла
   * внештатная ошибка, вследствие которой платеж был отменен, не стартовав.
   * Просьба инициировать оплату еще раз.
   */
  OPERATION_START_ERROR = 41,

  /**
   * Срок оплаты счета истек. Ошибка возникает, когда время, отведенное
   * для оплаты счета, истекло. Это касается только счетов, выставленных через
   * личный кабинет или с использованием метода JSON Web Token.
   */
  INVOICE_OUTDATED = 51,

  /**
   * Попытка повторной оплаты счета. Ошибка возникает при попытке повторно
   * оплатить уже оплаченный счет. Это касается только счетов, выставленных
   * через личный кабинет или с использованием метода JSON Web Token.
   */
  INVOICE_PAID = 52,

  /**
   * Счет не найден. Возникает, если ссылка на счет некорректна или сам счет
   * не существует. Эта ошибка касается только счетов, выставленных через личный
   * кабинет или с использованием метода JSON Web Token.
   */
  INVOICE_NOTFOUND = 53,

  /**
   * Функционал холдирования средств запрещен для магазина. Ошибка возникает,
   * если магазин не имеет разрешения на использование функционала
   * холдирования средств.
   */
  HOLD_UNAVAILABLE = 64,

  /**
   * Некорректные параметры для холдирования. Ошибка возникает при передаче
   * неверных параметров для выполнения операции холдирования средств.
   */
  HOLD_PARAMS_ERROR = 65,
}

/**
 * Внутренние ошибки сервиса. В случае возникновения данных ошибок, просьба
 * обратиться в поддержку сервиса Robokassa через раздел «Поддержка»
 * вашего личного кабинета.
 */
export const INTERNAL_ERRORS = [
  20, 21, 22, 23, 24, 27, 28, 32, 36, 37, 43, 500,
];
